>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. CALC-EMPRESTIMO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 VALOR-EMPRESTIMO    PIC 9(7)V99.
01 TAXA-JUROS          PIC 9(2)V99  VALUE 05.00.
01 VALOR-TOTAL         PIC 9(9)V99.
01 MASCARA-SAIDA       PIC $ZZZ,ZZZ,ZZ9.99.
01 VALOR-TEXTO         PIC X(9).

PROCEDURE DIVISION.
    *> Captura o valor enviado pelo Java via linha de comando
    ACCEPT VALOR-TEXTO FROM ARGUMENT-VALUE.
    
    *> Converte o texto para número
    MOVE FUNCTION NUMVAL(VALOR-TEXTO) TO VALOR-EMPRESTIMO.

    COMPUTE VALOR-TOTAL = VALOR-EMPRESTIMO + 
                         (VALOR-EMPRESTIMO * TAXA-JUROS / 100).
    
    MOVE VALOR-TOTAL TO MASCARA-SAIDA.
    
    DISPLAY "--- RESULTADO DO MOTOR COBOL ---".
    DISPLAY "VALOR SOLICITADO: R$ " VALOR-EMPRESTIMO.
    DISPLAY "TOTAL COM JUROS : " MASCARA-SAIDA.
    STOP RUN.
    